# ###1. Генерация ключей гибридной системы
# *Входные параметры:*  
# *1) путь, по которому сериализовать зашифрованный симметричный ключ;*  
# *2) путь, по которому сериализовать открытый ключ;*  
# *3) путь, по которому сериазизовать закрытый ключ.*

# 1.1. Сгеренировать ключ для симметричного алгоритма.  
# 1.2. Сгенерировать ключи для ассиметричного алгоритма.  
# 1.3. Сериализовать ассиметричные ключи.   
# 1.4. Зашифровать ключ симметричного шифрования открытым ключом и сохранить по указанному пути. 

# ###2. Шифрование данных гибридной системой
# *Входные параметры:*  
# *1) путь к шифруемому текстовому файлу (очевидно, что файл должен быть достаточно объемным);*  
# *2) путь к закрытому ключу ассиметричного алгоритма;*  
# *3) путь к зашированному ключу симметричного алгоритма;*  
# *4) путь, по которому сохранить зашифрованный текстовый файл;*  

# 2.1. Расшифровать симметричный ключ.  
# 2.2. Зашифровать текст симметричным алгоритмом и сохранить по указанному пути.   

# ###3. Дешифрование данных гибридной системой
# *Входные парметры:*  
# *1) путь к зашифрованному текстовому файлу;*  
# *2) путь к закрытому ключу ассиметричного алгоритма;*  
# *3) путь к зашированному ключу симметричного алгоритма;*  
# *4) путь, по которому сохранить расшифрованный текстовый файл.*  

# 3.1. Расшифровать симметричный ключ.  
# 3.2. Расшифровать текст симметричным алгоритмом и сохранить по указанному пути. 


import os
from cryptography.hazmat.primitives.asymmetric import rsa



def key_generation_func(symmetric_key_path: str, public_key_path: str, secret_key_path: str) -> None:
    # :param symmetric_key_path:  путь, по которому сериализовать зашифрованный симметричный ключ
    # :param public_key_path: путь, по которому сериализовать открытый ключ
    # :param secret_key_path: путь, по которому сериализовать закрытый ключ
    
        # генерация ключа симметричного алгоритма шифрования
        symmetric_key = os.urandom(16)

        # генерация пары ключей для асимметричного алгоритма шифрования
        keys = rsa.generate_private_key(
            public_exponent=65537,
            key_size=2048
        )
        private_key = keys
        public_key = keys.public_key()

        